meetings/simon/work_summary_20210329.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Progress update 2021-03-29</title>
<meta name="author" content="(Simon Sundberg)"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/moon.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Progress update 2021-03-29</h1><h2 class="author">Simon Sundberg</h2><p class="date">Created: 2021-03-29 mån 13:23</p>
</section>
<section id="table-of-contents"><div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#/slide-orgd679798">1. PPing</a>
<ul>
<li><a href="#/slide-org09df77b">1.1. PPing: verifier forgetting limits</a></li>
<li><a href="#/slide-org89da196">1.2. PPing: Infinite loop</a>
<ul>
<li><a href="#/slide-org5ff5950">1.2.1. PPing: Infinite loop - code</a></li>
</ul>
</li>
<li><a href="#/slide-orgf9f2138">1.3. PPing: Configurable rate-limit</a>
<ul>
<li><a href="#/slide-org3a29a6d">1.3.1. PPing: writing .rodata</a></li>
</ul>
</li>
<li><a href="#/slide-orgd48ca78">1.4. PPing: Documentation updated</a></li>
<li><a href="#/slide-org52284ea">1.5. PPing: Start with measurements</a></li>
</ul>
</li>
<li><a href="#/slide-org250afa3">2. Other</a></li>
</ul>
</div>
</div>
</section>

<section>
<section id="slide-orgd679798">
<h2 id="orgd679798"><span class="section-number-2">1</span> PPing</h2>
<ul>
<li>Have solved issue with verifier forgetting u8 limits after reading from stack</li>
<li>Have workaround for infinite loop problem, <b>NOT</b> solved root cause</li>
<li>Have pushed initial implementation of user-configurable rate-limit</li>
<li>Have updated documentation</li>

</ul>

</section>
<section id="slide-org09df77b">
<h3 id="org09df77b"><span class="section-number-3">1.1</span> PPing: verifier forgetting limits</h3>
<ul>
<li>Verifier keeps track of possible limits (min, max) for each register</li>
<li>If variable pushed and later read from stack, verifier forgets limits</li>
<li>Had an issue where verifier forgot limits for u8 variable
<ul>
<li>complained at potentially adding a negative value to a packet pointer</li>

</ul></li>
<li>Solved by adding <b>&amp;= 3f</b> first (verifier knows value has to be between 0-63)
<ul>
<li>If doing <b>&amp;= ff</b> instead, compiler skips it because compiler knows it's always true</li>

</ul></li>

</ul>

</section>
<section id="slide-org89da196">
<h3 id="org89da196"><span class="section-number-3">1.2</span> PPing: Infinite loop</h3>
<ul>
<li>Unfortunately, adding <b>&amp;= 3f</b> seemed to cause an infinite loop - verifier rejects</li>
<li>Seems to be due to compiler previously unrolled loop
<ul>
<li>extra instruction causes compiler to no longer unroll loop</li>

</ul></li>
<li>Still don't know why verifier thinks non-unrolled loop is infinite
<ul>
<li>Will at some point go back to try and identify issue</li>
<li>Will probably have to go through 4.7 million line output from verifier&#x2026;</li>

</ul></li>
<li>Have simply told compiler to unroll loop for now
<ul>
<li><b>MAX_TCP_OPTIONS</b> currently set to 10, may need to change in the future</li>
<li>Would be good if larger loop didn't have to be unrolled</li>
<li>&#x2026;but shouldn't be a major issue?</li>

</ul></li>

</ul>


</section>
<section id="slide-org5ff5950">
<h4 id="org5ff5950"><span class="section-number-4">1.2.1</span> PPing: Infinite loop - code</h4>
<div class="org-src-container">

<pre  class="src src-C"><code trim><span style="color: #483d8b;">#pragma</span> unroll <span style="color: #b22222;">//</span><span style="color: #b22222;">temporary solution</span>
<span style="color: #a020f0;">for</span> (i = 0; i &lt; MAX_TCP_OPTIONS; i++) {
    <span style="color: #a020f0;">if</span> (pos + 1 &gt; opt_end || pos + 1 &gt; data_end)
        <span style="color: #a020f0;">return</span> -1;

    opt = *pos;
    <span style="color: #a020f0;">if</span> (opt == 0) <span style="color: #b22222;">// </span><span style="color: #b22222;">Reached end of TCP options</span>
        <span style="color: #a020f0;">return</span> -1;

    <span style="color: #a020f0;">if</span> (opt == 1) { <span style="color: #b22222;">// </span><span style="color: #b22222;">TCP NOP option - advance one byte</span>
        pos++;
        <span style="color: #a020f0;">continue</span>;
    }

    <span style="color: #b22222;">// </span><span style="color: #b22222;">Option &gt; 1, should have option size</span>
    <span style="color: #a020f0;">if</span> (pos + 2 &gt; opt_end || pos + 2 &gt; data_end)
        <span style="color: #a020f0;">return</span> -1;
    opt_size = *(pos + 1);

    <span style="color: #b22222;">// </span><span style="color: #b22222;">Option-kind is TCP timestap (yey!)</span>
    <span style="color: #a020f0;">if</span> (opt == 8 &amp;&amp; opt_size == 10) {
        <span style="color: #a020f0;">if</span> (pos + opt_size &gt; opt_end || pos + opt_size &gt; data_end)
            <span style="color: #a020f0;">return</span> -1;
        *tsval = *(__u32 *)(pos + 2);
        *tsecr = *(__u32 *)(pos + 6);
        <span style="color: #a020f0;">return</span> 0;
    }
    <span style="color: #b22222;">// </span><span style="color: #b22222;">Other option - advance option-size bytes</span>
    opt_size &amp;= 0x3f; <span style="color: #b22222;">// </span><span style="color: #b22222;">Adding this instruction results in infinite loop</span>
    pos += opt_size;
}
</code></pre>
</div>

</section>
<section id="slide-orgf9f2138">
<h3 id="orgf9f2138"><span class="section-number-3">1.3</span> PPing: Configurable rate-limit</h3>
<ul>
<li>Use BPF global variable to communicate user-configured options to BPF program</li>
<li>Constant global variables seem to be stored in the .rodata section</li>
<li>Can be set by userspace before loading program
<ul>
<li>Writing to a specific map</li>
<li>Map name appears to be first 8 chars of object name + ".rodata"
<ul>
<li>Toke has pointed out this may change</li>

</ul></li>

</ul></li>
<li>Need to set the value for <b>ALL</b> .rodata</li>

</ul>

</section>
<section id="slide-org3a29a6d">
<h4 id="org3a29a6d"><span class="section-number-4">1.3.1</span> PPing: writing .rodata</h4>
<ul>
<li>Had an issue where .rodata appeared to be 20 bytes, but my user configuration was only 8 bytes</li>
<li>Found that it was due to other constant also being stored in .rodata</li>

</ul>

<div class="org-src-container">

<pre  class="src src-C"><code trim><span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">map_ipv4_to_ipv6</span>(<span style="color: #228b22;">__be32</span> <span style="color: #a0522d;">ipv4</span>, <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">in6_addr</span> *<span style="color: #a0522d;">ipv6</span>)
{
        <span style="color: #b22222;">// </span><span style="color: #b22222;">Works with libbpf, not with iproute (without libbpf support)</span>
        <span style="color: #228b22;">__u16</span> <span style="color: #a0522d;">ipv4_prefix</span>[] = { 0x0, 0x0, 0x0, 0x0, 0x0, 0xffff }; <span style="color: #b22222;">// </span><span style="color: #b22222;">This constant is stored in .rodata </span>
        __builtin_memcpy(ipv6, ipv4_prefix, <span style="color: #a020f0;">sizeof</span>(ipv4_prefix));
        ipv6-&gt;in6_u.u6_addr32[3] = ipv4;
}
</code></pre>
</div>
<ul>
<li>Changed back to older memset-solution to not have to push the ipv4-prefix from the loader</li>

</ul>

</section>
<section id="slide-orgd48ca78">
<h3 id="orgd48ca78"><span class="section-number-3">1.4</span> PPing: Documentation updated</h3>
<ul>
<li>Have updated the <a href="https://github.com/simosund/bpf-examples/blob/pping_Add_Sampling/pping/README.md">README</a>
<ul>
<li>Updated figure to include the flow_state map</li>
<li>Added brief descriptions of files and maps</li>
<li>Added some references to similar-ish projects</li>

</ul></li>
<li>Feel free to have a look</li>

</ul>

</section>
<section id="slide-org52284ea">
<h3 id="org52284ea"><span class="section-number-3">1.5</span> PPing: Start with measurements</h3>
<ul>
<li>Start to think about taking some real measurements
<ul>
<li>Jesper had some contacts at an ISP where it could maybe be deployed</li>
<li>Some artificial benchmark to compare performance to Kathie's pping?</li>

</ul></li>
<li>What features must be completed before we can start to use it?
<ul>
<li>Burst capabilitiy to handle delayed ACKs</li>
<li>Some updates to output format
<ul>
<li>Add timestamp to output</li>
<li>Add "machine friendly" format</li>

</ul></li>

</ul></li>

</ul>

</section>
</section>
<section>
<section id="slide-org250afa3">
<h2 id="org250afa3"><span class="section-number-2">2</span> Other</h2>
<ul>
<li><b>Institutional duty</b>: Done with Mobile &amp; Wireless, starting with GUI course</li>
<li><b>Info Ret</b>: Seminar went well, need to prepare for final handin</li>
<li><b>DISCO reading</b>: Seminar this Wednesday (31/3)</li>
<li><b>ISP</b>: Have sent first draft to Anna, need to translate to English&#x2026;</li>
<li><b>AIDA meeting</b>: Have an AIDA meeting tomorrow (30/3)</li>
<li><b>Easter</b>: What happens to supervision meeting on monday 5th?</li>

</ul>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
width:1500, height:900, slideNumber:"c/t",
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});


</script>
</body>
</html>
